{
  "arxivId": "2408.15725",
  "title": "Different Facets for Different Experts: A Framework for Streamlining The Integration of Qualitative Insights into ABM Development*",
  "summary": "## Summary of the Research Paper\n\nThis paper proposes a new software architecture for Agent-Based Models (ABMs) that makes it easier for non-programmers like domain experts and policy analysts to contribute to and use these models. It focuses on integrating qualitative, nuanced information into ABMs, which is traditionally difficult.\n\n## Key Points\n\n* **Qualitative data integration problem:** ABMs often simplify complex social phenomena, making it hard to incorporate qualitative insights.\n* **Facet-based architecture:** This allows separating different aspects of the model (e.g., housing, jobs), enabling domain experts to modify agent behavior without programming.\n* **BehaviorFlow:** This visual tool allows domain experts to define how agents make decisions based on their context and internal state, incorporating qualitative nuances.\n* **Policy interventions:** This enables policy analysts to easily test different scenarios and interventions without needing to understand the underlying code.\n* **Separation in time:** Different experts can contribute to the model at different stages, making it more flexible and adaptable to new information.\n\n## Applications to Software Projects\n\n* **Modular design:** The Facet approach promotes modularity, making it easier to manage and evolve complex multi-agent systems.\n* **Domain expert empowerment:** Consider how visual tools like BehaviorFlow can empower domain experts to directly shape AI agent behavior in your application.\n* **Simplified experimentation:** Provide user-friendly interfaces for non-programmers to experiment with different scenarios and policies, like the Policy intervention feature.\n* **Iterative development:** This architecture supports iterative development by allowing for easy integration of new insights and data over time. \n",
  "timestamp": "2024-08-29T07:00:37.995Z"
}