{
  "arxivId": "2408.15725",
  "title": "Different Facets for Different Experts: A Framework for Streamlining The Integration of Qualitative Insights into ABM Development*",
  "summary": "## Summary of the research paper\n\nThis paper introduces a new software framework for building agent-based models (ABMs) that simplifies incorporating qualitative insights from domain experts (like sociologists or economists) without requiring them to write code.\n\n## Key Points\n\n* **Integrating qualitative data into ABMs is hard:** Existing methods are often too simplistic, difficult to validate, or require constant updates as the real world changes.\n* **Facet-based Architecture:**  This paper proposes a new architecture that allows adding or removing modular components (\"facets\") representing different aspects of the model, even after development.\n* **BehaviourFlow:** This visual tool empowers domain experts to design how agents make decisions based on their context, internal state, and external factors, without programming.\n* **Separation-in-Time:** Different experts (programmers, domain experts, policymakers) can contribute to the model at different stages, even after deployment.\n* **Scenario Design:** Allows policymakers to experiment with different policies and interventions within the model without needing to understand its inner workings.\n\n##  Key Takeaways for Software Projects:\n\n* **Modular design is key for flexibility:**  The facet-based approach can be applied to other software projects to allow for easy addition/removal of features and easier collaboration.\n* **Visual tools empower non-programmers:**  Creating intuitive visual interfaces for complex logic (like BehaviourFlow) can enable domain experts to directly contribute to the project.\n* **Separation of concerns simplifies development:** Decoupling different aspects of the system (facets) and roles (programmer, expert, user) makes development and maintenance easier.\n* **Iterative and collaborative development:** The paper advocates for a continuous integration approach, where the model evolves over time with input from different stakeholders. \n",
  "timestamp": "2024-08-29T12:34:24.336Z"
}